# WORKING WITH DATA IN PANDAS

In [1]:
import pandas as pd

In [2]:
 # For the making of DataFrame we have taken a dictionary.
dict1 = {
    "Student": ['Sohan','Rani','Harsh','Sonu','Monu','Shayam','Rashika','Radha','Nitesh','Abhishek'],
    'Marks': [80,60,80,90,89,79,80,85,75,70],
    'Gender': ['Male','Female','Male','Male','Male', 'Male','Female','Female','Male','Male']
}
df = pd.DataFrame(dict1)
df

    Student  Marks  Gender
0     Sohan     80    Male
1      Rani     60  Female
2     Harsh     80    Male
3      Sonu     90    Male
4      Monu     89    Male
5    Shayam     79    Male
6   Rashika     80  Female
7     Radha     85  Female
8    Nitesh     75    Male
9  Abhishek     70    Male

1.Display the top 3 Rows of the Dataset

In [3]:
# To display the first 3 row
df.head(3)

  Student  Marks  Gender
0   Sohan     80    Male
1    Rani     60  Female
2   Harsh     80    Male

In [4]:
# Similary first six rows so
df.head(6)

  Student  Marks  Gender
0   Sohan     80    Male
1    Rani     60  Female
2   Harsh     80    Male
3    Sonu     90    Male
4    Monu     89    Male
5  Shayam     79    Male

In [5]:
#If we want to print the last three rows so 
df.tail(3)

    Student  Marks  Gender
7     Radha     85  Female
8    Nitesh     75    Male
9  Abhishek     70    Male

2. FIND SHAPE OF OUR DATASET (NUMBER OF ROWS & NUMBER OF COLUMNS)

In [6]:
# Shape basically means no of rows and number of the columns present in our dataset.
df.shape

(10, 3)

In [7]:
print('Number of rows :', df.shape[0])
print('Number of columns:',df.shape[1])

Number of rows : 10
Number of columns: 3

3. Get Information about our dataset like Total Number of rows, Total number of columns, Datatypes of Each columns and Memory Requirement.

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Student  10 non-null     object
 1   Marks    10 non-null     int64
 2   Gender   10 non-null     object
dtypes: int64(1), object(2)
memory usage: 372.0+ bytes

5. Check Null Values In the Dataset

In [9]:

df.isnull()
# Here you can see that it it generating dataframes in Boolean values

   Student  Marks  Gender
0    False  False   False
1    False  False   False
2    False  False   False
3    False  False   False
4    False  False   False
5    False  False   False
6    False  False   False
7    False  False   False
8    False  False   False
9    False  False   False

In [10]:
df.isnull().sum()
# So here you can see that it counting the Null values columns wise in our datafram
# 0 is showing becos we don't have any null values

Student    0
Marks      0
Gender     0
dtype: int64

In [11]:
df.isnull().sum(axis =1)
# Now it counting the NUll values Row wise.

0    0
1    0
2    0
3    0
4    0
5    0
6    0
7    0
8    0
9    0
dtype: int64

6. Get Overall Statistics About the DataFrame

In [12]:
df.describe()

           Marks
count  10.000000
mean   78.800000
std     8.929352
min    60.000000
25%    76.000000
50%    80.000000
75%    83.750000
max    90.000000

In [13]:
df.describe(include="all")
# NaN - Not a Number

       Student      Marks Gender
count       10  10.000000     10
unique      10        NaN      2
top      Sohan        NaN   Male
freq         1        NaN      7
mean       NaN  78.800000    NaN
std        NaN   8.929352    NaN
min        NaN  60.000000    NaN
25%        NaN  76.000000    NaN
50%        NaN  80.000000    NaN
75%        NaN  83.750000    NaN
max        NaN  90.000000    NaN

7. Find Unique Values from The Gender column

In [19]:
df['Gender'].unique()

# Here you can see the only two unique values is there --> Male and Female

array(['Male', 'Female'], dtype=object)

In [20]:
df['Student'].unique()

array(['Sohan', 'Rani', 'Harsh', 'Sonu', 'Monu', 'Shayam', 'Rashika',
       'Radha', 'Nitesh', 'Abhishek'], dtype=object)

In [23]:
df['Marks'].unique()

array([80, 60, 90, 89, 79, 85, 75, 70], dtype=int64)

In [21]:
df['Gender'].nunique()

2

8. Display Count of unique values in Gender Column

In [16]:
df['Gender'].value_counts()
# So this will print how many time occurs uniques values in our Dataset

Gender
Male      7
Female    3
Name: count, dtype: int64

9. Find Total Number of Studendts Having Marks Between 80 to 100 (inclusive) using Between method

In [17]:
df['Marks']

0    80
1    60
2    80
3    90
4    89
5    79
6    80
7    85
8    75
9    70
Name: Marks, dtype: int64

In [25]:
# Without using the Between method
df[df['Marks']>=80]

   Student  Marks  Gender
0    Sohan     80    Male
2    Harsh     80    Male
3     Sonu     90    Male
4     Monu     89    Male
6  Rashika     80  Female
7    Radha     85  Female

In [35]:
(df["Marks"]>=80) & (df['Marks']<=100)

0     True
1    False
2     True
3     True
4     True
5    False
6     True
7     True
8    False
9    False
Name: Marks, dtype: bool

In [36]:

df[(df["Marks"]>=80) & (df['Marks']<=100)]

   Student  Marks  Gender
0    Sohan     80    Male
2    Harsh     80    Male
3     Sonu     90    Male
4     Monu     89    Male
6  Rashika     80  Female
7    Radha     85  Female

In [37]:
# According to question
len(df[(df["Marks"]>=80) & (df['Marks']<=100)])

6

In [38]:
# By using the Between method,
df['Marks'].between(80,100)

0     True
1    False
2     True
3     True
4     True
5    False
6     True
7     True
8    False
9    False
Name: Marks, dtype: bool

In [39]:
sum(df['Marks'].between(80,100))

6

10. Find Average Marks

In [41]:
df

    Student  Marks  Gender
0     Sohan     80    Male
1      Rani     60  Female
2     Harsh     80    Male
3      Sonu     90    Male
4      Monu     89    Male
5    Shayam     79    Male
6   Rashika     80  Female
7     Radha     85  Female
8    Nitesh     75    Male
9  Abhishek     70    Male

In [42]:
df['Marks'].mean()

78.8

In [43]:
df.min()

Student    Abhishek
Marks            60
Gender       Female
dtype: object

In [44]:
df.max()

Student    Sonu
Marks        90
Gender     Male
dtype: object

12. Apply Method

In [51]:
def marks(x):
    return x//2
# for removing decimal values use x//2

In [52]:
df["Marks"].apply(marks)

0    40
1    30
2    40
3    45
4    44
5    39
6    40
7    42
8    37
9    35
Name: Marks, dtype: int64

In [53]:
# Now I am Addint this new data into our dataframe
df['Half_marks']=df["Marks"].apply(marks)

In [54]:
df

    Student  Marks  Gender  Half_marks
0     Sohan     80    Male          40
1      Rani     60  Female          30
2     Harsh     80    Male          40
3      Sonu     90    Male          45
4      Monu     89    Male          44
5    Shayam     79    Male          39
6   Rashika     80  Female          40
7     Radha     85  Female          42
8    Nitesh     75    Male          37
9  Abhishek     70    Male          35

13. Map Function

In [55]:
df['Gender'].map({'Male': 1, "Female": 0})

0    1
1    0
2    1
3    1
4    1
5    1
6    0
7    0
8    1
9    1
Name: Gender, dtype: int64

In [56]:
# lets create new column
df["Male_Female"]=df['Gender'].map({'Male':1, "Female":0})

In [57]:
df

    Student  Marks  Gender  Half_marks  Male_Female
0     Sohan     80    Male          40            1
1      Rani     60  Female          30            0
2     Harsh     80    Male          40            1
3      Sonu     90    Male          45            1
4      Monu     89    Male          44            1
5    Shayam     79    Male          39            1
6   Rashika     80  Female          40            0
7     Radha     85  Female          42            0
8    Nitesh     75    Male          37            1
9  Abhishek     70    Male          35            1

14. Drop the Columns(s)

In [58]:
df

    Student  Marks  Gender  Half_marks  Male_Female
0     Sohan     80    Male          40            1
1      Rani     60  Female          30            0
2     Harsh     80    Male          40            1
3      Sonu     90    Male          45            1
4      Monu     89    Male          44            1
5    Shayam     79    Male          39            1
6   Rashika     80  Female          40            0
7     Radha     85  Female          42            0
8    Nitesh     75    Male          37            1
9  Abhishek     70    Male          35            1

In [60]:
df.drop

<bound method DataFrame.drop of     Student  Marks  Gender  Half_marks  Male_Female
0     Sohan     80    Male          40            1
1      Rani     60  Female          30            0
2     Harsh     80    Male          40            1
3      Sonu     90    Male          45            1
4      Monu     89    Male          44            1
5    Shayam     79    Male          39            1
6   Rashika     80  Female          40            0
7     Radha     85  Female          42            0
8    Nitesh     75    Male          37            1
9  Abhishek     70    Male          35            1>

In [65]:
df.drop("Male_Female",axis =1)
# Remember her axis =1 means delets the columsn using the row wise

    Student  Marks  Gender  Half_marks
0     Sohan     80    Male          40
1      Rani     60  Female          30
2     Harsh     80    Male          40
3      Sonu     90    Male          45
4      Monu     89    Male          44
5    Shayam     79    Male          39
6   Rashika     80  Female          40
7     Radha     85  Female          42
8    Nitesh     75    Male          37
9  Abhishek     70    Male          35

In [67]:
# For the deleting of the two columns form the our the datasets
df.drop(['Male_Female','Half_marks'], axis = 1, inplace = True)

In [68]:
df

    Student  Marks  Gender
0     Sohan     80    Male
1      Rani     60  Female
2     Harsh     80    Male
3      Sonu     90    Male
4      Monu     89    Male
5    Shayam     79    Male
6   Rashika     80  Female
7     Radha     85  Female
8    Nitesh     75    Male
9  Abhishek     70    Male

15. Print the name of the columms

In [69]:
df.columns

Index(['Student', 'Marks', 'Gender'], dtype='object')

In [71]:
df.index

RangeIndex(start=0, stop=10, step=1)

16. Short the DataFrame as per the marks columns

In [72]:
df

    Student  Marks  Gender
0     Sohan     80    Male
1      Rani     60  Female
2     Harsh     80    Male
3      Sonu     90    Male
4      Monu     89    Male
5    Shayam     79    Male
6   Rashika     80  Female
7     Radha     85  Female
8    Nitesh     75    Male
9  Abhishek     70    Male

In [73]:
df.sort_values (by = 'Marks')

    Student  Marks  Gender
1      Rani     60  Female
9  Abhishek     70    Male
8    Nitesh     75    Male
5    Shayam     79    Male
0     Sohan     80    Male
2     Harsh     80    Male
6   Rashika     80  Female
7     Radha     85  Female
4      Monu     89    Male
3      Sonu     90    Male

17. Display Name & Marks of the Female Students

In [74]:
df

    Student  Marks  Gender
0     Sohan     80    Male
1      Rani     60  Female
2     Harsh     80    Male
3      Sonu     90    Male
4      Monu     89    Male
5    Shayam     79    Male
6   Rashika     80  Female
7     Radha     85  Female
8    Nitesh     75    Male
9  Abhishek     70    Male

In [78]:
df[df["Gender"]=='Female'][['Student','Marks']]

   Student  Marks
1     Rani     60
6  Rashika     80
7    Radha     85